In [29]:
import pandas as pd 
import json 
import yaml

In [2]:
with open('yaml_example.yaml') as file:
    data = file.read()

In [3]:
data

'Person:\n    - name: Alex\n      surname: Brown\n      role: "Student"\n      age: 20\n    - name: Chris\n      surname: Davis\n      role: Instructor\n      age: 31\n    - name: Emma\n      surname: Green\n      role: Student\n      age: 22\n    - name: John\n      surname: King\n      role: Admin\n      age: 27\n    - name: Lucy\n      surname: Miller\n      role: Admin\n      age: 24\n    - name: Nick\n      surname: Oliver\n      role: Professor\n      age: 45\n    - name: Paul\n      surname: Quinn\n      role: Assistant\n      age: 19'

In [5]:
data_v2 = data.split(':\n    ')

In [6]:
data_v2

['Person',
 '- name: Alex\n      surname: Brown\n      role: "Student"\n      age: 20\n    - name: Chris\n      surname: Davis\n      role: Instructor\n      age: 31\n    - name: Emma\n      surname: Green\n      role: Student\n      age: 22\n    - name: John\n      surname: King\n      role: Admin\n      age: 27\n    - name: Lucy\n      surname: Miller\n      role: Admin\n      age: 24\n    - name: Nick\n      surname: Oliver\n      role: Professor\n      age: 45\n    - name: Paul\n      surname: Quinn\n      role: Assistant\n      age: 19']

In [7]:
data_v2[1] = data_v2[1].split('-')

In [8]:
data_v2

['Person',
 ['',
  ' name: Alex\n      surname: Brown\n      role: "Student"\n      age: 20\n    ',
  ' name: Chris\n      surname: Davis\n      role: Instructor\n      age: 31\n    ',
  ' name: Emma\n      surname: Green\n      role: Student\n      age: 22\n    ',
  ' name: John\n      surname: King\n      role: Admin\n      age: 27\n    ',
  ' name: Lucy\n      surname: Miller\n      role: Admin\n      age: 24\n    ',
  ' name: Nick\n      surname: Oliver\n      role: Professor\n      age: 45\n    ',
  ' name: Paul\n      surname: Quinn\n      role: Assistant\n      age: 19']]

In [9]:
people = []
for person in data_v2[1]:
    people.append(person.strip().split('\n      '))

In [10]:
people

[[''],
 ['name: Alex', 'surname: Brown', 'role: "Student"', 'age: 20'],
 ['name: Chris', 'surname: Davis', 'role: Instructor', 'age: 31'],
 ['name: Emma', 'surname: Green', 'role: Student', 'age: 22'],
 ['name: John', 'surname: King', 'role: Admin', 'age: 27'],
 ['name: Lucy', 'surname: Miller', 'role: Admin', 'age: 24'],
 ['name: Nick', 'surname: Oliver', 'role: Professor', 'age: 45'],
 ['name: Paul', 'surname: Quinn', 'role: Assistant', 'age: 19']]

In [16]:
people_list = [] 
for person in people:
    if person != ['']:
        people_dict = {}
        for item in person:
            temp_variable = item.split(': ')
            try:               
                people_dict[temp_variable[0].strip()] = int(temp_variable[1].replace('"', '').strip())
            except:               
                people_dict[temp_variable[0].strip()] = temp_variable[1].replace('"', '').strip()
        people_list.append(people_dict)

In [17]:
people_list

[{'name': 'Alex', 'surname': 'Brown', 'role': 'Student', 'age': 20},
 {'name': 'Chris', 'surname': 'Davis', 'role': 'Instructor', 'age': 31},
 {'name': 'Emma', 'surname': 'Green', 'role': 'Student', 'age': 22},
 {'name': 'John', 'surname': 'King', 'role': 'Admin', 'age': 27},
 {'name': 'Lucy', 'surname': 'Miller', 'role': 'Admin', 'age': 24},
 {'name': 'Nick', 'surname': 'Oliver', 'role': 'Professor', 'age': 45},
 {'name': 'Paul', 'surname': 'Quinn', 'role': 'Assistant', 'age': 19}]

In [18]:
person = pd.DataFrame(people_list)

In [19]:
person

    name surname        role  age
0   Alex   Brown     Student   20
1  Chris   Davis  Instructor   31
2   Emma   Green     Student   22
3   John    King       Admin   27
4   Lucy  Miller       Admin   24
5   Nick  Oliver   Professor   45
6   Paul   Quinn   Assistant   19

In [30]:
with open('yaml_example.yaml') as file:
    yaml_data = yaml.safe_load(file)

In [31]:
yaml_data

{'Person': [{'name': 'Alex', 'surname': 'Brown', 'role': 'Student', 'age': 20},
  {'name': 'Chris', 'surname': 'Davis', 'role': 'Instructor', 'age': 31},
  {'name': 'Emma', 'surname': 'Green', 'role': 'Student', 'age': 22},
  {'name': 'John', 'surname': 'King', 'role': 'Admin', 'age': 27},
  {'name': 'Lucy', 'surname': 'Miller', 'role': 'Admin', 'age': 24},
  {'name': 'Nick', 'surname': 'Oliver', 'role': 'Professor', 'age': 45},
  {'name': 'Paul', 'surname': 'Quinn', 'role': 'Assistant', 'age': 19}]}

In [32]:
json_data = json.loads(json.dumps(yaml_data))

In [33]:
json_data

{'Person': [{'name': 'Alex', 'surname': 'Brown', 'role': 'Student', 'age': 20},
  {'name': 'Chris', 'surname': 'Davis', 'role': 'Instructor', 'age': 31},
  {'name': 'Emma', 'surname': 'Green', 'role': 'Student', 'age': 22},
  {'name': 'John', 'surname': 'King', 'role': 'Admin', 'age': 27},
  {'name': 'Lucy', 'surname': 'Miller', 'role': 'Admin', 'age': 24},
  {'name': 'Nick', 'surname': 'Oliver', 'role': 'Professor', 'age': 45},
  {'name': 'Paul', 'surname': 'Quinn', 'role': 'Assistant', 'age': 19}]}

In [37]:
new_data = pd.json_normalize(json_data['Person'])

In [38]:
new_data

    name surname        role  age
0   Alex   Brown     Student   20
1  Chris   Davis  Instructor   31
2   Emma   Green     Student   22
3   John    King       Admin   27
4   Lucy  Miller       Admin   24
5   Nick  Oliver   Professor   45
6   Paul   Quinn   Assistant   19